
export enum FieldEnum {
    "多行文本" = 1,
    "数字",
    "单选",
    "多选",
    "日期",
    "复选框" = 7,
    "人员" = 11,
    "电话号码" = 13,
    "超链接" = 15,
    "附件" = 17,
    单向关联,
    查找引用,
    公式,
    双向关联,
    地理位置,
    数学公式,
    集合运算,
    语义关联=25,
    lookUp=26,
    链接多行文本,
    创建时间 = 1001,
    最后更新时间,
    创建人,
    修改人,
    自动编号,
}

export enum NoteType{
    文件夹=1,
    笔记,
    表格,
    多维表格,
    待办事项,
    我的模板,
    回收站,
    收藏
}

export enum FriendEnum{
    好友,
    删除,
    拉黑
}

export enum ViewType{
    表格视图=1,
    甘特视图=2,
    图表视图=3,
    关联视图=4
}
